# IsValidOpeningForHide Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..IsValidOpeningForHide Method
AnalyticalModelSurface Class See Also
---
Returns true if opening with given Identifier could be hidden, false for all other Identifiers.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidOpeningForHide(
	ElementId openingId
)
```

Visual Basic
---
```text
Public Function IsValidOpeningForHide ( _
	openingId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidOpeningForHide(
	ElementId^ openingId
)
```

# ### Parameters
openingId
    Type: Autodesk.Revit.DB..::..ElementId Identifier of opening to check.
# ### Return Value
True for openings which are valid to be hidden, false for all other Identifiers.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace